{
    "es":{
        "menuOp1":"Inicio",
        "menuOp2":"Habilidades",
        "menuOp3":"Proyectos",
        "menuOp4":"Contacto",
        "tituloNombre":"¡Hola! mi nombre es Wilber Chacón.",
        "descripcion-home":"Soy un profesional apasionado y motivado, buscando nuevos desafíos en los que pueda aplicar mis habilidades o adquirir nuevas. A lo largo de mi formación he adquirido sólidos conocimientos y habilidades en desarrollo de software mediante cursos y proyectos académicos, destacando en colaboración, comunicación efectiva y resolución de problemas.",
        "descripcion-home2":"Tengo conocimientos en Windows server, Ubuntu server, Active Directory, Java, PHP, SQL, JavaScript, HTML, CSS y frameworks como Bootstrap, Laravel, Eloquent ORM, Hibernate y JavaServer Faces, etc. Estoy dispuesto a aprender rápidamente y adaptarme a nuevos entornos. Soy un pensador creativo y analítico, capaz de abordar desafíos con soluciones innovadoras.",
        "titulo-proyecto-1":"CRUD con PHP y MySQL",
        "tecnologias-proyecto":"Principales tecnologías:",
        "descripcion-proyecto-1":"Aplicación que permite insertar, consultar, editar y eliminar información almacenada en base de datos Mysql.",
        "boton-proyecto":"Ver repositorio",
        "contacto-mail":"Correo electrónico",
        "contacto-linkedin":"Perfil de linkedin",
        "contacto-github":"Perfil de github",
        "titulo-proyecto-2":"Lector y generador de archivo Excel",
        "descripcion-proyecto-2":"Aplicación que utiliza la tecnología de PhpSpreadsheet para generar reporte de productos por existencias en un archivo Excel y también leer los datos del mismo tipo de archivo para ser ingresados en la base de datos Mysql.",
        "titulo-proyecto-3":"API REST y cliente PHP",
        "descripcion-proyecto-3":"Servicio de API que permite realizar las operaciones de CRUD sobre una base de datos Mysql, además, se desarrolló un cliente en lenguaje PHP para el consumo del servicio API REST.",
        "titulo-proyecto-4":"API Rest con JSON Web Token",
        "descripcion-proyecto-4":"Servicio de API Rest que permite realizar las operaciones de registro y autenticación de usuarios por medio de la tecnología JSON Web Token, además de las operaciones CRUD sobre una tabla llamada products las cuales se almacenan en una base de datos Mysql y por medio de Eloquent ORM se manipulan los datos tratados en la API.",
        "titulo-proyecto-5":"Juego: piedra, papel o tijera en Java",
        "descripcion-proyecto-5":"Aplicación basada en el juego piedra, papel o tijera, el cual esta compuesto de tres partidas, en las que el jugador se enfrenta a un segundo jugador (maquina), en cada una de ellas se muestra el resultado de la partida y luego de las tres se muestra el resultado final del juego para dar a conocer si el jugador resulto victorioso, hubo un empate o perdió.",
        "titulo-proyecto-6":"CRUD con Java, JSP, MVC y MySQL",
        "descripcion-proyecto-6":"Aplicación desarrollada en leguaje Java que permite realizar las operaciones de insertar, consultar, actualizar y eliminar información de una base de datos MySQL. Este aplicativo comprende la programación orientada a objetos, así como el patrón de diseño MVC (modelo, vista controlador)."
    },
    "en":{
        "menuOp1":"Home",
        "menuOp2":"Skills",
        "menuOp3":"Projects",
        "menuOp4":"Contact",
        "tituloNombre":"¡Hello! my name is Wilber Chacón.",
        "descripcion-home":"I am a passionate and motivated professional, looking for new challenges in which I can apply my skills or acquire new ones. Throughout my training, I acquired solid knowledge and skills in software development through courses and academic projects, excelling in collaboration, effective communication and problem solving.",
        "descripcion-home2":"I have knowledge of Windows server, Ubuntu server, Active Directory, Java, PHP, SQL, JavaScript, HTML, CSS and frameworks such as Bootstrap, Laravel, Eloquent ORM, Hibernate and JavaServer Faces, etc. I am willing to learn quickly and adapt to new environments. I am a creative and analytical thinker, capable of addressing challenges with innovative solutions.",
        "titulo-proyecto-1":"CRUD with PHP and MySQL",
        "tecnologias-proyecto":"Main technologies:",
        "descripcion-proyecto-1":"Application that has the function of inserting, reading, updating and deleting information stored in the Mysql database.",
        "boton-proyecto":"View repository",
        "contacto-mail":"Email",
        "contacto-linkedin":"Linkedin profile",
        "contacto-github":"Github profile",
        "titulo-proyecto-2":"Excel file reader and generator",
        "descripcion-proyecto-2":"Application that uses PhpSpreadsheet technology to generate a product report by stock in an Excel file and also read the data from the same type of file to be entered into the Mysql database.",
        "titulo-proyecto-3":"API REST and PHP client",
        "descripcion-proyecto-3":"API service that contains CRUD operations on a Mysql database. In addition, a client was developed in PHP language for the consumption of the REST API service.",
        "titulo-proyecto-4":"API Rest with JSON Web Token",
        "descripcion-proyecto-4":"API service that allows user registration and authentication operations to be carried out through JSON Web Token technology, in addition to CRUD operations on a table called products which are stored in a Mysql database and through Eloquent ORM The data processed in the API is manipulated.",
        "titulo-proyecto-5":"Game: rock, paper, scissors in Java",
        "descripcion-proyecto-5":"Application based on the game rock, paper or scissors, which is composed of three games, in which the player faces a second player (machine), in each of them the result of the game is shown and then the Three shows the final result of the game to show whether the player was victorious, there was a tie or lost.",
        "titulo-proyecto-6":"CRUD with Java, JSP, MVC and MySQL",
        "descripcion-proyecto-6":"Application developed in Java language that allows you to perform the operations of inserting, querying, updating and deleting information from a MySQL database. This application understands object-oriented programming as well as the MVC (model, view controller) design pattern."
    }
}
